Revit 2027 API
MacroModuleIterator.MoveNext Method
 Increments the iterator to the next item.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool MoveNext()
Public Overridable Function MoveNext As Boolean
public:
virtual bool MoveNext()
abstract MoveNext : unit -> bool
override MoveNext : unit -> bool
Return Value
Boolean
 True if there is a next available item in this iterator. False if the iterator has completed all available items.
See Also
Reference
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace